VV_cases/V1_solver/results/study_v1/runs/004_data_of13_fluid_consistency_short/simulations/b060_medium_Re125/openfoam_setup/0.orig/U
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];
internalField   uniform (0.157916667 0.000157917 0);

boundaryField
{
    inlet
    {
        type            codedFixedValue;
        name            poiseuilleInlet;
        value           uniform (0 0 0);
        code
        #{
            vectorField v(this->patch().size(), vector::zero);
            const vectorField& cf = this->patch().Cf();
            forAll(v, i)
            {
                const scalar y = cf[i].y();
                v[i].x() = 0.157916667*(1.0 - sqr(2.0*y/0.020000000));
            }
            operator==(v);
        #};
    }
    outlet
    {
        type            pressureInletOutletVelocity;
        value           uniform (0.157916667 0 0);
    }
    top
    {
        type            noSlip;
    }
    bottom
    {
        type            noSlip;
    }
    cylinder
    {
        type            noSlip;
    }
    front
    {
        type            symmetryPlane;
    }
    back
    {
        type            symmetryPlane;
    }
}
