VV_cases/V1_solver/results/study_v1/runs/004_data_of13_fluid_consistency_short/simulations/b060_medium_Re125/openfoam_setup/system/controlDict
FoamFile
{
    format      ascii;
    class       dictionary;
    object      controlDict;
}

solver          fluid;
startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         10.000;
deltaT          0.001;
adjustTimeStep  yes;
maxCo           0.8;
writeControl    adjustableRunTime;
writeInterval   0.10;
purgeWrite      0;
writeFormat     ascii;
writePrecision  8;
timeFormat      general;
timePrecision   8;
runTimeModifiable true;

functions
{
    forceCoeffs
    {
        type            forceCoeffs;
        libs            ("libforces.so");
        executeControl  timeStep;
        writeControl    adjustableRunTime;
        writeInterval   0.01;
        log             yes;
        patches         (cylinder);
        rho             rhoInf;
        rhoInf          1.205000;
        CofR            (0 0 0);
        liftDir         (0 1 0);
        dragDir         (1 0 0);
        pitchAxis       (0 0 1);
        magUInf         0.157916667;
        lRef            0.012000;
        Aref            0.000120000;
    }

    residuals
    {
        type            residuals;
        libs            ("libutilityFunctionObjects.so");
        fields          (U p_rgh e);
        executeControl  timeStep;
        writeControl    adjustableRunTime;
        writeInterval   0.05;
    }
}
